In [76]:
# 【Python实战】Pandas：让你像写SQL一样做数据分析（一）
# https://www.cnblogs.com/en-heng/p/5630849.html

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = DataFrame({
    'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
    'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
    'sex': ['Female', 'Male', 'Male', 'Male', 'Female']
})

In [4]:
df

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [5]:
df.dtypes

sex            object
tip           float64
total_bill    float64
dtype: object

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.columns

Index([u'sex', u'tip', u'total_bill'], dtype='object')

In [8]:
df.values

array([['Female', 1.01, 16.99],
       ['Male', 1.66, 10.34],
       ['Male', 3.5, 23.68],
       ['Male', 3.31, 23.68],
       ['Female', 3.61, 24.59]], dtype=object)

In [9]:
df.shape

(5, 3)

In [10]:
# select

In [11]:
df.loc[1:3, ['total_bill', 'tip']]

   total_bill   tip
1       10.34  1.66
2       23.68  3.50
3       23.68  3.31

In [15]:
# loc，基于列label，可选取特定行（根据行index）
df.loc[1:3, 'total_bill']

1    10.34
2    23.68
3    23.68
Name: total_bill, dtype: float64

In [18]:
# iloc，基于行/列的position
df.iloc[1:3, [1, 2]]

    tip  total_bill
1  1.66       10.34
2  3.50       23.68

In [19]:
df.iloc[1:3, 1:3]

    tip  total_bill
1  1.66       10.34
2  3.50       23.68

In [20]:
# at，根据指定行index及列label，快速定位DataFrame的元素
df.at[3, 'tip']

3.31

In [21]:
# iat，与at类似，不同的是根据position来定位的
df.iat[3, 1]

3.31

In [22]:
# ix，为loc与iloc的混合体，既支持label也支持position: dprecated
df.ix[1:3, [1, 2]]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    tip  total_bill
1  1.66       10.34
2  3.50       23.68
3  3.31       23.68

In [23]:
df.ix[1:3, ['total_bill', 'tip']]

   total_bill   tip
1       10.34  1.66
2       23.68  3.50
3       23.68  3.31

In [24]:
df[1:3]

    sex   tip  total_bill
1  Male  1.66       10.34
2  Male  3.50       23.68

In [25]:
df[['total_bill', 'tip']]

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       23.68  3.50
3       23.68  3.31
4       24.59  3.61

In [26]:
# where
df[df['sex'] == 'Female']

      sex   tip  total_bill
0  Female  1.01       16.99
4  Female  3.61       24.59

In [27]:
df[df['total_bill'] > 20]

      sex   tip  total_bill
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [28]:
df.query('total_bill > 20')

      sex   tip  total_bill
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [29]:
# 在where子句中常常会搭配and, or, in, not关键词，Pandas中也有对应的实现

In [30]:
# and
df[(df['sex'] == 'Female') & (df['total_bill'] > 20)]

      sex   tip  total_bill
4  Female  3.61       24.59

In [33]:
# or
df[(df['sex'] == 'Female') | (df['total_bill'] > 20)]

      sex   tip  total_bill
0  Female  1.01       16.99
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [34]:
# in
df[df['total_bill'].isin([21.01, 23.68, 24.39])]

    sex   tip  total_bill
2  Male  3.50       23.68
3  Male  3.31       23.68

In [35]:
# not
df[-(df['sex'] == 'Make')]

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [36]:
df[-df['total_bill'].isin([21.01, 23.68, 24.59])]

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34

In [38]:
total = df.loc[df['tip'] == 1.66, 'total_bill']

In [43]:
total

1    10.34
Name: total_bill, dtype: float64

In [42]:
total.values[0]

10.34

In [44]:
total = df.get_value(df.loc[df['tip'] == 1.66].index.values[0], 'total_bill')

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: get_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

In [45]:
total

10.34

In [46]:
# distinct

In [47]:
df.drop_duplicates(subset=['sex'], keep='first', inplace=True)

In [48]:
df

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34

In [49]:
# group

In [50]:
df.groupby('sex').size()

sex
Female    1
Male      1
dtype: int64

In [51]:
df.groupby('sex').count()

        tip  total_bill
sex
Female    1           1
Male      1           1

In [54]:
df.groupby('sex')['tip'].count()

sex
Female    1
Male      1
Name: tip, dtype: int64

In [57]:
df = DataFrame({
    'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
    'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
    'sex': ['Female', 'Male', 'Male', 'Male', 'Female']
})

In [58]:
df.groupby('sex').agg({
    'tip': np.max, 'total_bill': np.sum
})

        total_bill   tip
sex
Female       41.58  3.61
Male         57.70  3.50

In [59]:
df

      sex   tip  total_bill
0  Female  1.01       16.99
1    Male  1.66       10.34
2    Male  3.50       23.68
3    Male  3.31       23.68
4  Female  3.61       24.59

In [61]:
df = DataFrame({
    'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
    'tip': [1.01, 1.66, 1.66, 3.31, 3.61],
    'sex': ['Female', 'Male', 'Male', 'Male', 'Female']
})

In [62]:
df.groupby('tip').agg({
    'sex': Series.nunique
})

      sex
tip
1.01    1
1.66    1
3.31    1
3.61    1

In [63]:
# as

In [64]:
df.columns = ['total', 'pit', 'xes']

In [65]:
df

    total   pit    xes
0  Female  1.01  16.99
1    Male  1.66  10.34
2    Male  1.66  23.68
3    Male  3.31  23.68
4  Female  3.61  24.59

In [66]:
df.rename(columns={'total': 'total_bill', 'pit': 'tip', 'xes': 'sex'}, inplace=True)

In [67]:
df

  total_bill   tip    sex
0     Female  1.01  16.99
1       Male  1.66  10.34
2       Male  1.66  23.68
3       Male  3.31  23.68
4     Female  3.61  24.59

In [69]:
# join
# df.join
# df.merge

In [70]:
# order

In [71]:
df.sort_values(['total_bill', 'tip'], ascending=[False, True])

  total_bill   tip    sex
1       Male  1.66  10.34
2       Male  1.66  23.68
3       Male  3.31  23.68
0     Female  1.01  16.99
4     Female  3.61  24.59

In [72]:
# top

In [74]:
df.nlargest(3, columns=['tip'])

  total_bill   tip    sex
4     Female  3.61  24.59
3       Male  3.31  23.68
1       Male  1.66  10.34

In [77]:
"""
# 1.
df.assign(rn=df.sort_values(['total_bill'], ascending=False)
          .groupby('sex')
          .cumcount()+1)\
    .query('rn < 3')\
    .sort_values(['sex', 'rn'])
    
# 2.
df.assign(rn=df.groupby('sex')['total_bill']
          .rank(method='first', ascending=False)) \
    .query('rn < 3') \
    .sort_values(['sex', 'rn'])
"""

"\n# 1.\ndf.assign(rn=df.sort_values(['total_bill'], ascending=False)\n          .groupby('sex')\n          .cumcount()+1)    .query('rn < 3')    .sort_values(['sex', 'rn'])\n    \n# 2.\ndf.assign(rn=df.groupby('sex')['total_bill']\n          .rank(method='first', ascending=False))     .query('rn < 3')     .sort_values(['sex', 'rn'])\n"

In [78]:
# replace